app/controllers/testings_controller.rb

  def index
    @testings = Testing.all
---
SELECT "testings".* FROM "testings"